---
title: DimensionSegmentArray
classe: Autodesk.Revit.DB.DimensionSegmentArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# DimensionSegmentArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `dimensionSegmentArray.IsEmpty` | Boolean |
| `DimensionSegment Item { get; set; }` | `dimensionSegmentArray.Item` | DimensionSegment |
| `Int32 Size { get; }` | `dimensionSegmentArray.Size` | Int32 |
| `Void Append(DimensionSegment)` | `dimensionSegmentArray.Append(item)` | Void |
| `Void Clear()` | `dimensionSegmentArray.Clear()` | Void |
| `DimensionSegmentArrayIterator ForwardIterator()` | `dimensionSegmentArray.ForwardIterator()` | DimensionSegmentArrayIterator |
| `IEnumerator GetEnumerator()` | `dimensionSegmentArray.GetEnumerator()` | IEnumerator |
| `Void Insert(DimensionSegment, Int32)` | `dimensionSegmentArray.Insert(item, index)` | Void |
| `DimensionSegmentArrayIterator ReverseIterator()` | `dimensionSegmentArray.ReverseIterator()` | DimensionSegmentArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```